HCM_Employee_Upload.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/types/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:downloadESSJobExecutionDetails>
         <typ:requestId>73095</typ:requestId>
         <typ:fileType>Log</typ:fileType>
      </typ:downloadESSJobExecutionDetails>
   </soapenv:Body>
</soapenv:Envelope>